Revit 2024 API
View3D.HasBeenLocked Method
 Identifies if the view has ever been locked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool HasBeenLocked()
Visual Basic
Public Function HasBeenLocked As Boolean
Visual C++
public:
bool HasBeenLocked()
See Also
View3D Class
Autodesk.Revit.DB Namespace